.. _sin_userguide:

Canadian Social Insurance Numbers
=================================

Introduction
------------

The function :func:`clean_ca_sin() <dataprep.clean.clean_ca_sin.clean_ca_sin>` cleans a column containing Canadian Social Insurance Number (SIN) strings, and standardizes them in a given format. The function :func:`validate_ca_sin() <dataprep.clean.clean_ca_sin.validate_ca_sin>` validates either a single SIN strings, a column of SIN strings or a DataFrame of SIN strings, returning `True` if the value is valid, and `False` otherwise.

SIN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "123456782"
* `standard`: SIN strings with proper whitespace in the proper places, like "123-456-782"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_ca_sin()` and `validate_ca_sin()`.

### An example dataset containing SIN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "sin": [
            "123456782",
            "12345678Z",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              sin                                           address
0       123456782                                     123 Pine Ave.
1       12345678Z                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_ca_sin`

By default, `clean_ca_sin` will clean sin strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_ca_sin
clean_ca_sin(df, column = "sin")

,sin,address,sin_clean
0,123456782,123 Pine Ave.,123-456-782
1,12345678Z,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_ca_sin(df, column = "sin", output_format="standard")

,sin,address,sin_clean
0,123456782,123 Pine Ave.,123-456-782
1,12345678Z,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_ca_sin(df, column = "sin", output_format="compact")

              sin                                           address  sin_clean
0       123456782                                     123 Pine Ave.  123456782
1       12345678Z                                           main st        NaN
2     51824753556                      1234 west main heights 57033        NaN
3  51 824 753 556                    apt 1 789 s maple rd manhattan        NaN
4           hello                robie house, 789 north main street        NaN
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
6            NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned SIN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_ca_sin(df, column="sin", inplace=True)

     sin_clean                                           address
0  123-456-782                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN  (staples center) 1111 S Figueroa St, Los Angeles
6          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_ca_sin(df, "sin", errors="coerce")

,sin,address,sin_clean
0,123456782,123 Pine Ave.,123-456-782
1,12345678Z,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_ca_sin(df, "sin", errors="ignore")

,sin,address,sin_clean
0,123456782,123 Pine Ave.,123-456-782
1,12345678Z,main st,12345678Z
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_ca_sin()`

`validate_ca_sin()` returns `True` when the input is a valid SIN. Otherwise it returns `False`.

The input of `validate_ca_sin()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_ca_sin()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_ca_sin()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_ca_sin
print(validate_ca_sin("123456782"))
print(validate_ca_sin("12345678Z"))
print(validate_ca_sin("51824753556"))
print(validate_ca_sin("51 824 753 556"))
print(validate_ca_sin("hello"))
print(validate_ca_sin(np.nan))
print(validate_ca_sin("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_ca_sin(df["sin"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: sin, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_ca_sin(df, column="sin")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: sin, dtype: bool

### Only DataFrame

In [11]:
validate_ca_sin(df)

     sin  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False